In [11]:
import pandas as pd
import numpy as np

pd.set_option("display.max_columns", None)

In [12]:
df = pd.read_csv("data/dataset.csv")
df.head()

,customer_id,order_date,product_id,category_id,category_name,product_name,quantity,price,payment_method,city,review_score,gender,age
0,13542,17-12-2024,784,10,Electronics,Smartphone,2,373.36,Credit Card,New Oliviaberg,1.0,F,56
1,23188,01-06-2024,682,50,Sports & Outdoors,Soccer Ball,5,299.34,Credit Card,Port Matthew,NaN,M,59
2,55098,04-02-2025,684,50,Sports & Outdoors,Tent,5,23.00,Credit Card,West Sarah,5.0,F,64
3,65208,28-10-2024,204,40,Books & Stationery,Story Book,2,230.11,Bank Transfer,Hernandezburgh,5.0,M,34
4,63872,10-05-2024,202,20,Fashion,Skirt,4,176.72,Credit Card,Jenkinshaven,1.0,F,33

In [13]:
# Dataset has ____ rows and ____ columns
df.shape

(1000, 13)

In [ ]:
#“The dataset contains 1,000 records and 13 features related to customer purchases, 
#including customer demographics, product details, pricing, and transaction metadata.”

In [14]:
df.columns

Index(['customer_id', 'order_date', 'product_id', 'category_id',
       'category_name', 'product_name', 'quantity', 'price', 'payment_method',
       'city', 'review_score', 'gender', 'age'],
      dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     1000 non-null   int64
 1   order_date      1000 non-null   object
 2   product_id      1000 non-null   int64
 3   category_id     1000 non-null   int64
 4   category_name   1000 non-null   object
 5   product_name    1000 non-null   object
 6   quantity        1000 non-null   int64
 7   price           1000 non-null   float64
 8   payment_method  1000 non-null   object
 9   city            1000 non-null   object
 10  review_score    799 non-null    float64
 11  gender          897 non-null    object
 12  age             1000 non-null   int64
dtypes: float64(2), int64(5), object(6)
memory usage: 101.7+ KB

In [16]:
df.describe()

,customer_id,product_id,category_id,quantity,price,review_score,age
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,799.000000,1000.000000
mean,55490.723000,540.726000,30.030000,2.947000,251.850660,3.992491,46.382000
std,25910.185857,261.737704,14.370303,1.413573,139.194688,1.239469,16.569992
min,10201.000000,100.000000,10.000000,1.000000,10.720000,1.000000,18.000000
25%,33857.000000,311.750000,20.000000,2.000000,128.525000,3.000000,32.000000
50%,54619.500000,542.500000,30.000000,3.000000,250.220000,4.000000,47.000000
75%,77848.500000,770.750000,40.000000,4.000000,366.467500,5.000000,61.000000
max,99923.000000,995.000000,50.000000,5.000000,499.500000,5.000000,75.000000

In [17]:
# Observed some cancelled transactions with negative quantity
df.sample(5)

,customer_id,order_date,product_id,category_id,category_name,product_name,quantity,price,payment_method,city,review_score,gender,age
16,75474,22-05-2024,107,40,Books & Stationery,Notebook,1,117.47,Credit Card,Levyport,4.0,M,73
993,94141,01-09-2024,701,20,Fashion,Skirt,4,270.32,Bank Transfer,North Jeannemouth,5.0,M,48
95,94316,14-06-2024,979,30,Home & Living,Vase,1,146.35,Bank Transfer,Garzachester,2.0,M,18
80,95322,14-03-2025,621,50,Sports & Outdoors,Running Shoes,2,34.61,Credit Card,Marcusville,5.0,M,43
843,79723,16-07-2024,568,10,Electronics,Smartwatch,1,393.90,Bank Transfer,Popeview,5.0,M,44

In [ ]:
#The dataset contains 1,000 purchase records with information about customers, products, and transactions.
#Most columns are complete, but review_score and gender have missing values.
#The order_date column is currently stored as an object and will need conversion to datetime for time-based analysis.
#The dataset appears suitable for analyzing customer behavior, product performance, and sales trends.